kell5/esp32_ble_mesh/rgb_light/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Flash: N16R8 = 16MB flash, 8MB octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# OTA partition layout
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Unified WiFi provisioning over BLE
CONFIG_EXAMPLE_PROV_TRANSPORT_BLE=y
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y

# HTTP(S) OTA: firmware is served over plain HTTP from the deployment server
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

CONFIG_FREERTOS_HZ=1000
